Дипломный_проект/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерПочасовой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломный_проект/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дипломный_проект/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Дипломный_проект/src/Documents/ВКМ_НачислениеЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Или Не ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.СписокСотрудников.Доступность = Ложь;	
		
	Конецесли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Объект.ДатаНачала = НачалоМесяца(Объект.ДатаНачала);
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.СписокСотрудников.Доступность = Истина;	
		
	Конецесли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)  
	
	Объект.ДатаОкончания = КонецМесяца(Объект.ДатаОкончания); 
	
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		Элементы.СписокСотрудников.Доступность = Истина;	
		
	Конецесли;

	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокСотрудников

&НаКлиенте
Процедура СписокСотрудниковСотрудникПриИзменении(Элемент)
	
	ТекущаяСтрокаТЧ = Элементы.СписокСотрудников.ТекущиеДанные; 
	
	ТекущийСотрудник = ТекущаяСтрокаТЧ.Сотрудник;
	
	ДанныеТекущегоСотрудника = СписокСотрудниковСотрудникПриИзмененииНаСервере(ТекущийСотрудник); 
	
	ТекущаяСтрокаТЧ.Размер          = ДанныеТекущегоСотрудника.Оклад;
	ТекущаяСтрокаТЧ.ТипРасчета      = ДанныеТекущегоСотрудника.ТипРасчета;
	ТекущаяСтрокаТЧ.РазмерПочасовой = ДанныеТекущегоСотрудника.РазмерПочасовой;
	
КонецПроцедуры                                                                                     

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СписокСотрудниковСотрудникПриИзмененииНаСервере(ТекущийСотрудник)
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.ВидРасчета КАК ВидРасчета,
	               |	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход КАК СуммаКОплатеПочасовая
	               |ИЗ
	               |	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, ) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, Период, Сотрудник = &Сотрудник) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
	               |		ПО ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
	               |ГДЕ
	               |	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
				   

	Запрос.УстановитьПараметр("Период", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Объект.ДатаОкончания);
	Запрос.УстановитьПараметр("Сотрудник", ТекущийСотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДанныеТекущегоСотрудника = Новый Структура; 
		
		ДанныеТекущегоСотрудника.Вставить("Оклад",           Выборка.Оклад);
		ДанныеТекущегоСотрудника.Вставить("ТипРасчета",      Выборка.ВидРасчета);
		ДанныеТекущегоСотрудника.Вставить("РазмерПочасовой", Выборка.СуммаКОплатеПочасовая); 
		
	КонецЦикла;
	
	Возврат ДанныеТекущегоСотрудника;
	
КонецФункции

#КонецОбласти
